specs/artillery.yml
config:
  target: 'http://localhost:3004'
  phases:
    # - duration: 60
    #   arrivalRate: 10
    # - duration: 120
    #   arrivalRate: 10
    #   rampTo: 25
    # - duration: 1200
    #   arrivalRate: 25
    - duration: 600
      arrivalRate: 100
scenarios:
  - flow:
      # - loop:
      - get:
          url: '/api/reviews/{{ $randomNumber(9000000, 10000000) }}'
      - get:
          url: '/api/reviews/{{ $randomNumber(9000000, 10000000) }}/3'